using System;

namespace lesson_18_client_server_1
{
    class Program
    {
        static void Main(string[] args)
        {
            // сервер ожидает сигнал-запрос
            // tcp utp - два протокола для обмена данными
            // tcp чёткое соединение всё будет получено с гарантией
            // tcp работает медленнее
            // tcp - одному человеку сказал в лицо
            // utp - проорал на толпу
            // tcp - сайт, http реализуется на TCP
            // utp - для стриминга получает много людей
            // IP and PORT
            // endpoint точка подключения
            // socket дырочка в которой можно установить соединение
            // 
            // порты меняются для каждого endpointa

            // если ты отправил запрос и на сервере генерится отчёт пять минут?
            // благодаря async основной поток принимает запросы вычисления делаются в отдельном потоке
            // вызвется callback функция


        }
    }
}
